# MixedPhasesInAssembly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..MixedPhasesInAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Assembly cannot be created. All elements must have the same phases to be included in an assembly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MixedPhasesInAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MixedPhasesInAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MixedPhasesInAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace